"""
from https://www.youtube.com/watch?v=9KcsjeHSqkE กุ๊กขี้เมา EP.3 | ซอสผัดเงินล้าน | ซอสผัดอเนกประสงค์ | Multi-purpose stir-fry sauce |

สูตรซอสผัดอเนกประสงค์ ซอสผัดเงินล้าน 

1. น้ำมันหอย ( ตราเพนกวิ้น 3 ตัว )   1000 กรัม
2. น้ำตาลทราย ( มิตรผล )               150 กรัม 
3. ซอสปรุงรสฝาเขียว ( ภูเขาทอง )     75 กรัม 
4. รสดีหมู                                      120 กรัม 
5. พริกไทขาวป่น ( ARO )      5 กรัม 
6. เหล้าจีน ( ตราเจดีย์ )                    50 กรัม 
7. ผงชูรส ( ใส่ก็นัว ไม่ใส่ก็ได้จ้า )       100กรัม

"""

from rezipe import Ingredient
from rezipe.unit import *

sauce = [
    Ingredient('น้ำมันหอย', 1000 * กรัม),
    Ingredient('น้ำตาลทราย', 150 * กรัม),
    Ingredient('ซอสปรุงรสฝาเขียว', 75 * กรัม),
    Ingredient('รสดีหมู', 120 * กรัม),
    Ingredient('พริกไทขาวป่น', 5 * กรัม),
    Ingredient('เหล้าจีน', 50 * กรัม),
    Ingredient('ผงชูรส', 100 * กรัม),
]

